# creating a dataframe

1. using dict

In [18]:
import pandas as pd
dict_states={"states":["HR", "DL","PB","GJ","HP" ],
            "year":[2010,2011,2010,2010,2012],
            "pop": [1.5,2.4,2.1,3.2,1.8]}

In [19]:
import pandas as pd
df1=pd.DataFrame(dict_states)

In [20]:
df1

  states  year  pop
0     HR  2010  1.5
1     DL  2011  2.4
2     PB  2010  2.1
3     GJ  2010  3.2
4     HP  2012  1.8

In [21]:
df1.head()

  states  year  pop
0     HR  2010  1.5
1     DL  2011  2.4
2     PB  2010  2.1
3     GJ  2010  3.2
4     HP  2012  1.8

In [22]:
df1.columns

Index(['states', 'year', 'pop'], dtype='object')

In [23]:
df2=pd.DataFrame(dict_states,columns=["year","states","pop" ])

In [24]:
df2

   year states  pop
0  2010     HR  1.5
1  2011     DL  2.4
2  2010     PB  2.1
3  2010     GJ  3.2
4  2012     HP  1.8

In [25]:
frame2 = pd.DataFrame(dict_states, columns=['year', 'states', 'pop', 'debt'],
 index=['one', 'two', 'three', 'four','five'])

In [26]:
frame2

       year states  pop debt
one    2010     HR  1.5  NaN
two    2011     DL  2.4  NaN
three  2010     PB  2.1  NaN
four   2010     GJ  3.2  NaN
five   2012     HP  1.8  NaN

In [38]:
import numpy as np
debt1=np.arange(5.)
frame2.debt=debt1

In [39]:
frame2

       year states  pop  debt
one    2010     HR  1.5   0.0
two    2011     DL  2.4   1.0
three  2010     PB  2.1   2.0
four   2010     GJ  3.2   3.0
five   2012     HP  1.8   4.0

In [40]:
frame2.loc["three"]

year      2010
states      PB
pop        2.1
debt         2
Name: three, dtype: object

In [41]:
#adding a boolean column
# Note: Columns cannot be created or deleted with '.' frame2.'eastern' will result in error 
frame2['eastern'] = frame2.states == 'DL'

In [42]:
frame2

       year states  pop  debt  eastern
one    2010     HR  1.5   0.0    False
two    2011     DL  2.4   1.0     True
three  2010     PB  2.1   2.0    False
four   2010     GJ  3.2   3.0    False
five   2012     HP  1.8   4.0    False

In [31]:
#deleting a column
del frame2["eastern"]

In [16]:
frame2

       year states  pop  debt
one    2010     HR  1.5   0.0
two    2011     DL  2.4   1.0
three  2010     PB  2.1   2.0
four   2010     GJ  3.2   3.0
five   2012     HP  1.8   4.0

# 2. creating dataframe with nested dict of dicts

In [45]:
pop = {'DL': {2010: 2.4, 2012: 2.9, 2014: 5.3},
 'PB': {2010: 1.5, 2011: 1.7, 2012: 3.6}}

In [46]:
frame3 = pd.DataFrame(pop)

In [47]:
frame3

       DL   PB
2010  2.4  1.5
2012  2.9  3.6
2014  5.3  NaN
2011  NaN  1.7

In [35]:
frame3.T

    2010  2012  2011
DL   2.4   2.9   NaN
PB   1.5   3.6   1.7

In [36]:
pd.DataFrame(pop, index=[2010, 2011, 2012])

       DL   PB
2010  2.4  1.5
2011  NaN  1.7
2012  2.9  3.6

Creating dataframe : other methods
2D ndarray : A matrix of data, passing optional row and column labels
dict of arrays, lists, or tuples : Each sequence becomes a column in the DataFrame; all sequences must be the same length
NumPy structured/record array: Treated as the “dict of arrays” case
dict of Series: Each value becomes a column; indexes from each Series are unioned together to form the
result’s row index if no explicit index is passed
dict of dicts: Each inner dict becomes a column; keys are unioned to form the row index as in the “dict of
Series” case
List of dicts or Series: Each item becomes a row in the DataFrame; union of dict keys or Series indexes become the
DataFrame’s column labels
List of lists or tuples: Treated as the “2D ndarray” case
Another DataFrame :The DataFrame’s indexes are used unless different ones are passed
NumPy MaskedArray: Like the “2D ndarray” case except masked values become NA/missing in the DataFrame result

In [37]:
d1={"a":1, 'b':2, 'c':3}

max1=np.argmax(list(d1.values()))
list(d1.keys())[max1]

'c'

# from 2D ndarray

In [49]:
datafm=pd.DataFrame(np.arange(16).reshape(4,4),index=['Delhi','Mumbai','Chennai','kolkata'],columns=['one','two','three','four'])

In [50]:
datafm

         one  two  three  four
Delhi      0    1      2     3
Mumbai     4    5      6     7
Chennai    8    9     10    11
kolkata   12   13     14    15

# from dict of arrays

In [51]:
datadic={"col1":np.array(["a","b","c","d"]), "col2":np.array([1,2,3,4])}

In [52]:
datafm1=pd.DataFrame(datadic)

In [53]:
datafm1

  col1  col2
0    a     1
1    b     2
2    c     3
3    d     4

# indexing in DFs

In [ ]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index
index[1:]